[
  {
    "id": 1,
    "title": "SZA Thanks Kendrick Lamar For Grand National Tour",
    "subtitle":"SZA has paid tribute to Kendrick Lamar for bringing her along on the Grand National tour.",
    "date": "August 11, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/5tRZFy1M/SZA-Kendrick.jpg",
    "content": "The TDE singer has now wrapped her stint on the record breaking tour and has nothing but love for her longtime friend and collaborator.\n\nOn Instagram Stories, she wrote: “This tour was the craziest most once in a lifetime experience I’ve ever had. Like all my childhood thoughts in one bang… WHAT WAS THAT? Lmao not a lot of words. Thank you to every single person involved that made this happen. Especially Kendrick Lamar.”\n\nSZA also paid tribute to Kendrick while they were on stage together during a stop on the tour in June.\n\nGetting emotional, SZA said: “He put me onto the biggest moment of my life. This is also the biggest moment of my life… I’m so thankful, and I’m so thankful to y’all.”\n\nThe two “Luther” collaborators then shared a close hug before continuing to perform.\n\nSZA previously revealed she had doubts over the co-headlining tour with the rap superstar.\n\nSitting down for a chat with Chappell Roan for Interview Magazine, SZA has confessed to suffering from anxiety.\n\nShe said: “Every time I had to go on stage, every time I had to get on a carpet, I’d have full-on panic attacks. I used to not show up to something because it was like, ‘I’m never going to win. No one cares that I’m here. Why would I go?’”\n\nThe TDE singer said those issues spilled over into her tour with Kendrick: “Same thing with the Kendrick tour. Everybody’s going to see Kendrick. I don’t even know if I have anything to show these people that’s exciting and new.”\n\nThe “Kill Bill” superstar went on to say that she was doing much better: “Now it’s just like, ‘Fuck it. I don’t have anything else to do, and I want to see where this door is going to lead.’ I want to walk through the door. I want to see what happens in the uncertainty.”\n\nKendrick recently announced some extra stadium dates for the tour when it lands in Australia where he will be accompanied by Doechii."
  },
  {
    "id": 2,
    "title": "Offset Says A Joint Album With Quavo Is ‘Possible’",
    "subtitle":"Offset has said that it is possible that he and Quavo could reunite for a joint album.",
    "date": "August 15, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/ryrLx1KZ/offset-quavo.jpg",
    "content": "Speaking to Ebro on Apple Music, Offset was open to once again getting in the booth with Quavo, at least to pay tribute to the late third member of Migos, Takeoff.\n\nThe Atlanta rapper said: “It’s possible. No conversations about that, though, but it’s possible. First, we’re just checking in with each other and see each other’s worlds: ‘You good?’”\n\nOffset then took responsibility for causing some of the estrangement between himself and Quavo: “I’ve accepted the actions I’ve done to cause certain situations to happen — I had to. But at first I didn’t. I was trying to act tough and like I didn’t give a fuck at first. But the actions that I did in the time I was acting that way, I realized I was wrong. I realized I was wrong and had to get out of the way. I’m happy with everything and I want the best.”\n\nOffset recently revealed that things between himself and Quavo were the best they had been in some time.\n\nSpeaking on 7PM in Brooklyn, the former Migos rapper said: “It be the internet trying to do some old shit, but with us, it ain’t about that. We gotta holla at each other in the day, at the end of the day, man. That’s family at the end of the day, man. You’re gonna bump heads with your family sometime.\n\n“In the day, a n-gga ain’t finna play with him, or a n-gga ain’t finna play with me.”\n\nOver the last couple of years, rumors have swirled that the two rappers were no longer getting on with them sitting far apart from each other at an NBA game.\n\nIt was also rumored that both rappers got into a fight backstage at the Grammy Awards, though Offset denied the rumors soon after and wrote on Twitter: “What tf look like fighting my brother yal n-ggas is crazy.”\n\nThe pair later reunited to honor Takeoff at the 2023 BET Awards with a medley of “Hotel Lobby” and “Bad and Boujee.”"
  },
  {
    "id": 3,
    "title": "Drake Continues To Tease ‘Iceman’ Dropping",
    "subtitle":"Drake has been blasted by UMG boss Lucian Grainge.",
    "date": "August 11, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/mkCf4svW/drake.jpg",
    "content": "The Hip Hop superstar went live on Kick accompanied by the likes of Adin Ross, xQc and longtime collaborator PartyNextDoor.\n\nDuring the livestream, Drizzy spoke about the recording process for his new project.\n\nHe said: “I’ll stay up all night fucking recording for Iceman. They’re having a full blown party outside. I can hear people and having a street festival all day. I’ll go out there.I’ll fucking run out there. I’ll turn up with them, do shots, come back— like, I just want a little, you know, I wanna feel it.”\n\nDrake also boldly claimed that his upcoming album Iceman has “too many bangers”.\n\nAlongside a number of recent images of what the rap star has been up to on his first European tour in six years, Drizzy wrote: “Tired…too many bangers.”\n\nWhile Iceman is yet to receive a release date or track list, Drake has already dropped two singles from the highly anticipated project.\n\nThe most recent of which failed to make any real dent on the Billboard charts that Drake has ruled over for the last 15 years.\n\n“Which One?” is a collaboration with British rapper Central Cee but it has failed to cause a stir among fans as it has been unable to crack the top 20, debuting at number 23.\n\nThe song was initially tracking for a top 10 debut but the track lost momentum on streaming leading to his worst charting official single release since 2017’s “Signs”.\n\nThe lead single from the album “What Did I Miss?” has also fallen outside the top 30 after just four weeks on the chart after its debut at number two.\n\nDrake recently spoke during a tour stop in the Netherlands where he claimed that he was a good person.\n\nHe said to the sold out crowd: “I didn’t get here by being a piece of shit, I didn’t get here by being a snake, I didn’t get here by being a dickhead. I got here by being good to people, being nice to people, and my karma is straight. That’s why I’m still on stage in 2025.”"
  },
  {
    "id": 4,
    "title": "Kanye West Drops Teaser For ‘In Whose Name?’ Documentary",
    "subtitle":"Kanye West has dropped the first teaser for his highly anticipated all-access documentary In Whose Name?",
    "date": "August 14, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/PrbsFdbm/kanye.jpg",
    "content": "Kanye West has dropped the first teaser for his highly anticipated all-access documentary In Whose Name?\n\nThe film, directed by teenager Nico Ballesteros, was shot over the last six years of West’s life and covers the multitude of controversial events from that time period including his divorce from Kim Kardashian, antisemitic rants and bizarre public behavior.\n\nIn Whose Name? is currently scheduled to premiere on September 19 and will play nationwide in cinemas.\n\nThe minute long teaser shows West in a number of intimate settings where he discusses his mental health, refusal to take medication and an emotional row with Kardashian.\n\nThe clip also shows West in his infamous White Lives Matter shirt, his Sunday Service concerts and the rollout of his Donda album.\n\nAt one point in the teaser, West can be heard saying: “I would rather be dead than be on medication… Either they destroy me or I destroy it.. I’m almost like a masochist… I write whatever I want when I want! It’s words!”\n\nA synopsis for the documentary reads: “What began as silent observation evolved into a profound journey of artistic and personal growth. Immersed in Ye’s world of extremes, [Ballesteros] bore witness to brilliance and breakdowns, triumphs and turmoil; but also observed the paranoia and intensity that increasingly shaped Ye’s world.\n\n“In the end, Ballesteros captured not just a portrait of Ye, but a reflection of the human condition in all its contradictions. The camera never blinks as Ye speaks candidly about living with bipolar disorder, offering rare insight into the realities of mental illness and its impact on identity, perception, and power. Through a personal lens, the film considers how mental health is handled – or left unspoken – among the weight of visibility and vulnerability.”\n\nJust in time for the release of the film, West has begun selling clothes again after Shopify shut down his online store earlier this year after he went on numerous antisemitic rants on social media.\n\nThe new designs only feature white, black and grey items and range from hoodies to underwear with most of the items retailing for $20 though sum go up to $60.\n\nWest is also selling footwear as part of the range including sliders, slippers and trainers."
  },
  {
    "id": 5,
    "title": "Tyler, The Creator Has A Surprising Favorite Member Of G-Unit",
    "subtitle":"Tyler, The Creator has revealed that he has a favorite member of G-Unit and it’s not who most would expect.",
    "date": "August 14, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/PqxgxZg4/tyler.jpg",
    "content": "50 Cent is most fans’ pick but Tyler has different thoughts and said that Lloyd Banks is his favorite rhymer from the seminal New York rap crew.\n\nA fan on social media posted a mashup of Tyler’s “Hot Wind Blows” along with Banks’ “I’m So Fly” with the clip eventually catching the attention of the Odd Future founder.\n\nIn response, Tyler revealed that he was a day one fan of Banks: “sick. bought hunger for more the day it came out. banks was my fav from g-unit.”\n\nBanks saw Tyler’s post and responded “Appreciate it.”\n\nTyler recently explained his creative philosophy in a conversation with Zane Lowe for Apple Music.\n\nHe said: “I didn’t wanna be precious. I didn’t want to spend three years and try to be super innovative. … I made an album, I was done.”\n\nTyler went on to explain: “I was just gonna upload that muthafucka the moment it was done and continue moving on with my life because I just wanted it out. And it’s so easy to design your own handcuffs, lock yourself up, and put the key over there that just turns…into pressure, whether it’s from you or fans.”\n\nHe added: “People end up scared and not putting albums out for 15 years because they feel like they always have to — ‘I got to make the most innovative, best stuff.’ And sometimes, man, that song is good. Just put that bitch out. ‘Cause when n-ggas is 80 years old, you really think [you] about to sit here [with] all this great music on a hard drive, be like, ‘Oh fuck, it wasn’t…’ Fuck it, put it out.”\n\nThe “Sticky” rapper concluded by saying: “But the beauty in it is like my idea on that might change tomorrow. I might work on something new be like, ‘Oh, I gotta spend five years on this album and this bridge and get these strings right.’ But where I’m at now, I’m like, ‘Oh my god, I just wanna make stuff and put it out like when I was 17,’ ’cause that shit was just fun and free.”"
  },
  {
    "id": 6,
    "title": "will.i.am calls out ICE raids on new single ‘East L.A.’",
    "subtitle":"Kid Cudi has admitted that he was reluctant to testify against Diddy in his sex trafficking trial earlier this year.", 
    "date": "August 12, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/hvF6pYfy/will-i-am.jpg",
    "content": "will.i.am has called out the ICE raids that have been taking place across California on his new single “East L.A.”\n\nAccompanied by his longtime Black Eyed Peas cohort Taboo, the rapper and producer looks to celebrate Los Angeles culture.\n\nOn the track, Will raps: “I love Mexicanas from the Border / Make her my wife so ICE won’t deport her.”\n\nAlso in the video for the song, he says: “Black people, my ancestors, know exactly some version of what’s happening right now. We’ve been through what you guys are going through right now. And that’s why I stand in solidarity with Latinos.”\n\nwill.i.am also posted a statement which accompanied the song’s release which reads: “We are Los Angeles. We are Angelenos. We are Americans. Some of us born here, some of us migrated here. We are a great country and our borders should be protected. You would think that the idea of border control would make residents feel safe – but it’s pumped fear into our communities.”\n\nIce Cube also recently slammed the ICE raids being conducted under the orders of Donald Trump.\n\nThe rap legend stopped by local radio station 92.3’s The Cruz Show where he was asked about ICE’s crackdown on immigration across the city.\n\nHe said: “It hurts because it’s all kind of different situations been going around, as far as immigration.”\n\nCube added: “But to see people disrespected like that, and federal government just being too heavy-handed and disrespectful going to churches and weddings and grabbing people out those schools. It’s like come on man, y’all just overdoing it.”\n\nThe rapper and actor also said: “And then the country flip flops. First it’s cool, then it’s not … It’s like, how could somebody even keep up with what’s going on? It’s sad. I can’t wait til this period is over. I don’t know how we going to get to the end but … It’s crazy to see people dragged out of their spots of refuge.”Earlier this year, Doechii used her speech at the BET Awards to call out Trump’s aggressive action against immigrant communities across America.\n\nShe said: “There are ruthless attacks that are creating fear and chaos in our communities in the name of law and order.”"
  },
  {
    "id": 7,
    "title": "Westside Gunn Rips Dr. Dre’s Album ‘Compton’",
    "subtitle":"Westside Gunn has again ripped into Dr. Dre‘s last album Compton.",
    "date": "August 15, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/qR6WcrM6/westside-gunn.jpg",
    "content": "Initially released in 2015, the Griselda rapper made it clear he did not think much of the long-awaited project a decade ago.\n\nHe wrote on social media: “N-ggas waited 15 years for Compton to drop and it’s trash and it took me 15 hours to make Hitler Wears Hermes 2 and it’s a masterpiece.”\n\nFollowing up on his post 10 years later, Gunn added: “10 years later and still not impressed by none of these n-ggas. Still making albums in a day and 12 still AOTY contender, Heels Have Eyes EP of the year. All with no machine, no fake beefs, no gimmicks, no clickbait, just art… this been hella of a ride and I did everything my way… God is the greatest.”\n\nDr. Dre is yet to respond to Westside Gunn’s comments.\n\nThe Buffalo rapper is not the only Hip Hop star to throw some shade Dre’s way of late with DJ Quik making it clear he believes he is deserving of the same kind of recognition that his fellow LA native receives.\n\nOn X, a fan wrote: “DJ Quik is actually who everyone thinks Dr. Dre is.”\n\nQuik then responded to the post, commenting: “Finally. Someone had the balls to say it.”\n\nIt is not the first time Quik has put himself on the same pedestal as the NWA co-founder.\n\nBack in 2022, he said: “I know it’s early. But I deserve to be where Dre is. I don’t think it’s fair, but I understand why. I’ve never had a machine behind me, that always hurt my friends more than it did me.”\n\nHe added: “This doesn’t need to be on a podcast. Because you have fire starters, who want to spin everything to get more ratings. But the truth is: I love Dr. Dre, like a big brother, one I never had. It pains me when people pit us against each other.”\n\nQuik also said: “I know I’ll never be as popular as I need to be, but I have 10s of artists superstars. And when they shine, I just smile. The janitor doesn’t get all the glory, but he keeps the backstage, clean as a triage.”"
  },
  {
    "id": 8,
    "title": "RZA Wants A$AP Rocky To Name His Third Child After Ol’ Dirty Bastard",
    "subtitle": "RZA wants A$AP Rocky and Rihanna to name their third child after late Wu-Tang Clan legend, Ol’ Dirty Bastard.",
    "date": "August 15, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/RZMrk2G2/rocky.jpg",
    "content": "RZA wants A$AP Rocky and Rihanna to name their third child after late Wu-Tang Clan legend, Ol’ Dirty Bastard.\n\nThe power couple already named one of their children after the Wu-Tang leader and he is now suggesting they continue the trend for their next baby.\n\nHe said to People: “You know what? OBD, because you know the legend must live on.\n\nRZA previously said how happy he was to be honored by Rocky and RiRi in the unique way.\n\nHe said to CNN: “[It’s] a great honor to know that there’s another generation that’s not even of my own household that feels the strength and the inspiration of that name.\n\n“RZA isn’t only a name, it’s a title. So it’s an honor and I salute her and A$AP and their family. All the blessings in the world from me.”\n\nA$AP Rocky recently dropped a big hint about what he and Rihanna could name their third child.\n\nAppearing on Late Night with Seth Meyers alongside Anna Wintour, the talk show host asked the rap star if he and RiRi were going to continue a trend they had started with their first two children, Riot and RZA.\n\nMeyers said: “Your first two kids have ‘R’ names, obviously you and Rihanna have ‘R’ names. Is this a lock that the third will have an ‘R’ name, do you think?”\n\nRocky simply replied: “For sure.”\n\nIf Rocky and RiRi press ahead with that plan then they would have to renege on a promise made to the rapper’s lawyer Joe Tacopina to name their next child after him.\n\nSpeaking to Extra shortly after Rocky was found not guilty in his shooting trial. Tacopina said: “They grabbed me and they said, ‘Listen, our next baby is A$AP Joe.’”\n\nTacopina said he replied by telling Rocky and RiRi: “I’m gonna hold you to that.”\n\nRihanna unveiled her pregnancy at the Met Gala back in May where Rocky served as co-chair.\n\nThe 37-year-old Barbadian superstar appeared fashionably late at the fashion event of the year and could be seen sporting a pronounced baby bump which she cradled in front of the awaiting media."
  },
  {
    "id": 9,
    "title": "Young Thug Calls Out Gunna In New Song Snippet",
    "subtitle":"Young Thug has taken a direct shot at Gunna in a snippet from a yet to be released song.",
    "date": "August 12, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/DwBVn5M0/thugger.jpg",
    "content": "At what appeared to be a listening event for Lil Baby’s forthcoming album The Leak$, Thugger uses his guest verse to fire at Gunna in his most blatant way since he was released from jail last year.\n\nHe raps: “Only reason I fucked with you, Gunna, it was ’cause of Troup,” referring to the late Keith B. Troup, who was a friend and mentor to both men who was murdered in 2015.\n\nGunna has yet to respond to the diss from his former friend.\n\nThugger previously addressed his relationship with Gunna during a sit down with GQ.\n\nThe journalist brought up the rumors of a rift between the YSL rappers and asked what the status is. However, Thug didn’t provide a clear answer.\n\n“I know everybody wonders [what our relationship is like now],” he noted, before saying: “I don’t know.”\n\nThe same day the interview was released (though it had been conducted weeks earlier), Young Thug dropped the lead single from his upcoming album Uy Scuti titled “Money On Money” featuring Future.\n\nWhile the track is a bombastic return to the Atlanta star’s best, it’s most notable for some lines that appear to be aimed at his former friend and his decision to take an Alford plea during YSL’s long-running and controversial RICO trial.\n\nOn the song’s hook, Thug raps: “These fuck n-ggas tellin’ for nothin’, and I gotta be the one callin’ ’em friends.”\n\nHe later spits: “Brother, you a rat (My brother).”\n\nThugger also reiterated the accusation in a subsequent verse: “Twin, you a rat, you smoked, uh.”\n\nGunna has always denied snitching on Young Thug but it is not the first time his label boss has appeared to label him a rat.\n\nOn a snippet of a track he posted on his Instagram, Thug could be heard rapping: “Never associate with a rat/ Go and get some money, get a pack.”\n\nGunna’s former lawyer, Steve Sadow, also denied that the rapper had cooperated with prosecutors in exchange for a plea."
  },
  {
    "id": 10,
    "title": "Nipsey Hussle To Have LA Metro Station Named After Him",
    "subtitle":"Nipsey Hussle is set to have a metro station in Los Angeles named after him.",
    "date": "August 15, 2025",
    "autor": "Sam Moore",
    "image": "https://i.postimg.cc/1511H8Fm/nipsey.jpg",
    "content": "Nipsey Hussle is set to have a metro station in Los Angeles named after him.\n\nIn honor of what would have been the rapper’s 40th birthday, Los Angeles Metro are renaming Hyde Park station after the Compton native until the end of August.\n\nNipsey was involved in the revitalization of the area near to the station.\n\nFurthermore, the city are also releasing two TAP cards that celebrate the late rapper with 12,000 cards available across the city which feature Nipsey.\n\nNipsey Hussle‘s brother Blacc Sam previously said a posthumous album from the late rapper would be arriving this summer.\n\nAppearing on Power 106’s Brown Bag Morning Show back in February, Sam revealed the LP will be a joint project with Bino Rideaux and that it was recorded before Nipsey was killed in 2019.\n\n“If Hussle didn’t actually do the verse or work with the person or put together the blueprint for the project, we not doing it,” Sam said. “He did something with Bino and there’s a new project that we’re about to release. This was a project that he had with Bino that was pretty much like 80% finished.”\n\nHe continued: “So the team kind of came in, got some unreleased verses and music that he had done with Bino and just tightened it up. It sounds amazing. It should be coming out around this summer. The team is real excited. We just finished going over all the stuff for the last three weeks with everybody.”Blacc Sam was at the show to promote Nipsey Hussle’s Marathon Brand amid the opening of a new burger restaurant in his home city of Los Angeles.\n\nThe restaurant opened in March on Melrose and Gardner, just a short distance from Nipsey’s Marathon clothing store, and will sell smash burgers.\n\nThe dining room of the restaurant features images of the late rapper.\n\n“The Marathon team is excited to expand the brand into the restaurant industry here in L.A.,” Nipsey’s team said in a statement.\n\n“When Nipsey birthed The Marathon (Brand), launching it with The Marathon mixtape in 2010, the goal was always to enterprise this into a full lifestyle brand — music, fashion, food/hospitality, and entertainment. This is another step towards reaching Hussle’s vision.”"
  }
]
